src/resource/CFDEM_example/CFDEM_Example_1mm_SI/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// The order of vertices is important. If it's not defined by the rule of OpenFOAM, blockMesh command can not run.

scale 1e-3;

vertices
(
( -5 -5 -40 ) 
( 5 -5 -40 ) 
( 5 5 -40 ) 
( -5 5 -40 ) 
( -5 -5 50 ) 
( 5 -5 50 ) 
( 5 5 50 ) 
( -5 5 50 ) 
);

blocks
(
hex (0 1 2 3 4 5 6 7) ( 10 10 90 ) simpleGrading (1 1 1) 
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (5 6 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

    repeat_boundary
    {
        type wall;
        faces
        (
		(0 1 5 4)
		(1 2 6 5)
		(3 7 6 2)
		(4 7 3 0)
        );
    }

);

// ************************************************************************* //
